---
kind: type
id: T:Autodesk.Revit.DB.RuledFace
source: html/1a973af7-5f14-26b4-25e8-af69fc6f0901.htm
---
# Autodesk.Revit.DB.RuledFace

A ruled face of a 3d solid or open shell.

## Syntax (C#)
```csharp
public class RuledFace : Face
```

## Remarks
A ruled surface is created by sweeping a line between two profile curves or between a curve and a point (a point and a curve).
For details on the parameterization, refer to the documentation for RuledSurface .